/**
 *
 * @param videoUrl e.g. http://wxapp.tc.qq.com/251/20302/stodownload?encfilekey=Cvvj5Ix3eewK0tHtibORqcsqchXNh0Gf3sJcaYqC2rQDD2eqCNUdEQficz41zicWIFcHGOY2NQD4lPLVs1yF7lIkI5LHmm2X6w5j10vaLFkpgw4VR2mO3JTROfbbBLkibjkw&token=Cvvj5Ix3eez97Zf6tIkrGrdAoXicjiaFuP5qIfDsvWtF91YEs3gEPa0ADxHuAMGvFTuMp7wubhNsH6b04np4HWM0158XgwBfvvPia5qViatgOEvQiakriaju8UPFQnUGoTI8nia&idx=1&bizid=1023&dotrans=0&hy=SH&m=&upid=0
 * @param options
 *
 * @return e.g.
 * 乐视绝对是公司里的一股清流
 * 在各大公司普遍逼着员工加班
 * 以及普遍性别歧视
 * 还有35岁年龄歧视的时候
 * 他居然宣布
 * 你给他投的简历不需要写年龄
 * 还有婚育情况
 * 在面试的过程中
 * 面试官也不能够问你这些问题
 * 只有在拿到offer之后
 * 或者是在你入职之后
 * 负责员工档案管理的那个人
 * 才有权看到你的身份证信息
 * 人家还特别提到一句话
 * 无论你处在人生的哪个阶段
 * 只要是你能干
 * 你给他创造价值就行
 * 其实本来不就应该这样吗
 * 只要我能给你企业创造价值
 * 你管我多大岁数了
 * 你管我结没结婚呢
 * 有人说乐视啊
 * 就是作秀
 * 也有人说
 * 只要是哪怕他能更改一点点这个风气
 * 哪怕是作秀那又怎么样呢
 * 其实这还真不是作秀
 * 因为乐视我去过
 * 还去过不止一次
 * 去年的时候
 * 乐视宣布执行四天半工作制
 * 每周三弹性工作半天
 * 然后呢我就挑了一下周三下午
 * 我就过去了去了之后一看
 * 人确实很少
 * 工位上稀稀拉拉的
 * 然后我就问他们说
 * 哎你们不是这个半天休息吗
 * 怎么你们还在呢
 * 人家告诉我哦
 * 我们是上午休息的
 * 下午来上班的
 * 哈哈哈
 * 更之前的时候
 * 傍晚时分我也去过一趟
 * 一到下班的点
 * 人家就真的是背上包
 * 陆陆续续就走了
 * 不存在那种大范围加班的情况
 * 所以人家是真的没有作秀啊是真的在执行
 * 对于延长工作时间加班这个事情
 * 我之前也说过很多遍
 * 用压榨工厂工人的方式
 * 逼着脑力工作者
 * 延长工作时间就是一个特别傻的行为
 * 就是一种内耗
 * 你如果说硬逼员工
 * 非得逼着他加班的话
 * 他一个小时能干完的活
 * 他能磨你两三个小时
 * 你还不知道
 * 结果就是你企业什么好处没捞着
 * 员工呢还把自己本来该休息的时间给浪费了
 * 你就不如给他自由
 * 让他自由安排这些时间
 * 反而他愿意把活好好干完
 * 赶紧交差
 * 赶紧下班
 * 赶紧走人
 * 回家享受生活
 * 互相之间都是一个很爽的事情
 * 干嘛非得硬逼着人家
 * 没事还得在这加个班呢
 * 所以我觉得乐视这个行为啊
 * 你看着他是在作秀
 * 实际上是一个非常非常务实的一个决策
 * 既能宣传打造自己这个品牌形象
 * 又能让员工干的爽
 * 真的是一举多得
 * 哈哈何乐而不为呢
 */
export declare const video2text: (videoUrl: string, options?: object) => string;
